<?php
/**
 * Created by JetBrains PhpStorm.
 * User: Андрей
 * Date: 12.09.13
 * Time: 16:15
 * To change this template use File | Settings | File Templates.
 */

class Translit {
    CONST TYPE_CYR_TO_LAT = 1;
    static function string($string, $type = self::TYPE_CYR_TO_LAT){
        $pattern = array(
            'q'=>'й',
            'w'=>'ц',
            'e'=>'у',
            'r'=>'к',
            't'=>'е',
            'y'=>'н',
            'u'=>'г',
            'i'=>'ш',
            'o'=>'щ',
            'p'=>'з',
            'a'=>'ф',
            's'=>'ы',
            'd'=>'в',
            'f'=>'а',
            'g'=>'п',
            'h'=>'р',
            'j'=>'о',
            'k'=>'л',
            'l'=>'д',
            'z'=>'я',
            'x'=>'ч',
            'c'=>'с',
            'v'=>'м',
            'b'=>'и',
            'n'=>'т',
            'm'=>'ь',

            '['=>'х',
            ']'=>'ъ',
            ';'=>'ж',
            '\''=>'э',
            ','=>'б',
            '.'=>'ю',
            '`'=>'ё',

        );
        return strtr($string, $pattern);
    }

    /**
     * @param $string
     * @return string
     */
    public static function  rus2translit($string) {
        $converter = array(
            'а' => 'a',   'б' => 'b',   'в' => 'v',
            'г' => 'g',   'д' => 'd',   'е' => 'e',
            'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
            'и' => 'i',   'й' => 'y',   'к' => 'k',
            'л' => 'l',   'м' => 'm',   'н' => 'n',
            'о' => 'o',   'п' => 'p',   'р' => 'r',
            'с' => 's',   'т' => 't',   'у' => 'u',
            'ф' => 'f',   'х' => 'h',   'ц' => 'c',
            'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
            'ь' => '',    'ы' => 'y',   'ъ' => '',
            'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

            'А' => 'a',   'Б' => 'b',   'В' => 'v',
            'Г' => 'g',   'Д' => 'd',   'Е' => 'e',
            'Ё' => 'e',   'Ж' => 'zh',  'З' => 'z',
            'И' => 'i',   'Й' => 'y',   'К' => 'k',
            'Л' => 'l',   'М' => 'm',   'Н' => 'n',
            'О' => 'o',   'П' => 'p',   'Р' => 'r',
            'С' => 's',   'Т' => 't',   'У' => 'u',
            'Ф' => 'f',   'Х' => 'h',   'Ц' => 'c',
            'Ч' => 'ch',  'Ш' => 'sh',  'Щ' => 'sch',
            'Ь' => '',    'Ы' => 'y',   'Ъ' => '',
            'Э' => 'e',   'Ю' => 'yu',  'Я' => 'ya',

            '.' => '',    ' ' => '-',   ',' => ',',
            '/' => '',    '\\'=> '',    '"' => '',
            '*' => '-',   '(' => '',    ')' => '',
            '[' => '',    ']' => '',    '+' => '',
        );
        return strtr($string, $converter);
    }
}